Tekla Open API Reference for Tekla Structures 2025
PositionTypeAttribute.Type Property
 The custom attribute [PositionType()] uses this to store the position type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PositionTypeEnum Type { get; }
Public ReadOnly Property Type As PositionTypeEnum
	Get
Property Value
Type: PositionTypeEnum
See Also
Reference
PositionTypeAttribute Class
Tekla.Structures.Plugins Namespace